    {
      "@id": "m2:MetaconceptCombo",
      "@type": [
        "owl:NamedIndividual",
        "m2:MetaConcept"
      ],
      "rdfs:label": "MetaconceptCombo (Synergistic Combination)",
      "rdfs:comment": "Parameterized metaconcept produced by synergistic combination of N parent metaconcepts (N ≥ 2) via n-ary tensor assembly and emergence morphism (⊗ⁿ⇒). The result is a new metaconcept whose semantic identity cannot be reduced to any subset of parents - shared dimensions between parents create multi-way epistemic coupling rather than simple concatenation. First metaconcept in M2 whose tensor formula is structural (parameterized) rather than fixed. Most practical instances use N=2 or N=3 for tractability. Instances are domain-specific and belong to M1 extensions via functor_instantiation.",
      "m2:hasCategory": "m2:Ontological",
      "m2:hasTensorFormula": "⊗ᵢ₌₁ⁿ Mᵢ ⇒ M_result",
      "m2:hasTensorFormulaTeX": "\\bigotimes_{i=1}^{n} M_i \\Rightarrow M_{result}",
      "m2:hasTensorFormulaASCII": "(x)_i=1^n M_i => M_result",
      "m2:hasDominantM3": [
        "m3:eagle_eye:Structure",
        "m3:eagle_eye:Information",
        "m3:eagle_eye:Attractor"
      ],
      "m2:hasEpistemicGap": 0.4,
      "m2:hasPolarity": "neutral",
      "m2:formulaSemantics": {
        "n": "Number of parent metaconcepts (n ≥ 2, typically n ∈ {2,3} for practical instances)",
        "Mᵢ": "i-th parent metaconcept (i = 1..n) - each parent is a parameter",
        "M_result": "Emergent metaconcept - exists only as synergistic product of all n parents, semantically irreducible to any subset",
        "⊗ᵢ₌₁ⁿ": "N-ary tensor assembly of parent formulas - shared dimensions create multi-way coupling, not duplication",
        "⇒": "Emergence morphism (m2:morphism_emergence) - guarantees M_result has properties that no subset of parents possesses alone"
      },
      "m2:couplingRule": {
        "description": "When parent formulas share dimensions, those dimensions CREATE MULTI-WAY COUPLING across all parents that share them. Coupling complexity increases with number of parents: binary (n=2) yields pairwise coupling, ternary (n=3) yields triplet interactions, n-ary yields n-way coupling. This is the mechanism that produces emergence - the distinction between a naive tensor product (⊗) and a synergistic combination (⊗⇒).",
        "binaryCase": {
          "formula": "M_A ⊗ M_B ⇒ M_C",
          "description": "Most common case - two parent metaconcepts combine",
          "example": {
            "parent_A": "ValueSpace = Iₜ ⊗ V ⊗ O ⊗ R ⊗ Iₘ",
            "parent_B": "Amplification = Fₜ ⊗ D ⊗ Iₜ ⊗ R ⊗ O",
            "sharedDimensions": [
              "Iₜ",
              "R",
              "O"
            ],
            "effect": "Iₜ couples territory-information content with amplification signal; R couples representability of value-space with amplification stages; O couples observability of variety with amplification observability. Result is a reduced emergent subspace, not a naive 10D concatenation.",
            "instances": [
              "VarietyAmplification = ValueSpace ⊗ Amplification (directed variety increase)",
              "VarietyAttenuation = ValueSpace ⊗ Amplification (directed variety reduction)"
            ]
          }
        },
        "ternaryCase": {
          "formula": "M_A ⊗ M_B ⊗ M_C ⇒ M_D",
          "description": "Three parent metaconcepts - creates triplet coupling on shared dimensions",
          "examples": [
            "AdaptiveRegulatedLearning = Regulation ⊗ Adaptation ⊗ Memory ⇒ feedback-controlled learning with historical context",
            "ResilientModularEvolution = Resilience ⊗ Modularity ⊗ Evolution ⇒ fault-tolerant systems that adapt structure over time",
            "ContextualAdaptiveControl = Context ⊗ Adaptation ⊗ Regulation ⇒ control that adapts based on environmental state"
          ]
        },
        "naryCase": {
          "formula": "⊗ᵢ₌₁ⁿ Mᵢ ⇒ M_result (n ≥ 4)",
          "description": "Four or more parents - theoretical possibility, rarely used in practice",
          "constraint": "As n increases, epistemic gap typically increases (harder to verify emergent properties)",
          "pragmaticLimit": "Most domain instances use n=2 or n=3 for tractability and verifiability",
          "dimensionalExplosion": "Naive product dimensionality grows as ∏ᵢ dim(Mᵢ), but coupling contraction reduces actual emergent space"
        }
      },
      "m2:nArityCoupling": {
        "binaryReduction": "When n=2, reduces to M_A ⊗ M_B ⇒ M_C (current dominant pattern)",
        "dimensionalityGrowth": {
          "naiveTensorProduct": "dim(⊗ᵢ₌₁ⁿ Mᵢ) = ∏ᵢ₌₁ⁿ dim(Mᵢ) (exponential growth)",
          "withCoupling": "dim(M_result) < ∏ᵢ₌₁ⁿ dim(Mᵢ) due to shared dimension contraction",
          "contractionMechanism": "Shared dimensions create trace-like contraction: dim(M_result) ≈ ∑ᵢ dim(Mᵢ) - |shared_dimensions| × (n-1)"
        },
        "couplingComplexity": {
          "pairwiseTerms": "C(n,2) = n(n-1)/2 potential pairwise couplings",
          "tripletTerms": "C(n,3) potential 3-way couplings",
          "generalKway": "C(n,k) potential k-way interactions for k-subsets of parents"
        },
        "epistemicChallenge": "As n increases, verifiability (V dimension in REVOI) decreases - harder to validate emergent properties against all parent combinations. Trade-off: expressiveness vs. epistemic tractability."
      },
      "m2:hasExample": [
        "VarietyAmplification (n=2, M1_VSM) = MetaconceptCombo(ValueSpace, Amplification) - amplifies variety while preserving epistemic accessibility (VSM S2)",
        "VarietyAttenuation (n=2, M1_VSM) = MetaconceptCombo(ValueSpace, Amplification) - attenuates variety while maintaining verifiability (VSM S3)",
        "RecursiveViability (n=2, M1_VSM) = MetaconceptCombo(Imbrication, Autonomy) - each nested level maintains operational independence",
        "AdaptiveRegulatedLearning (n=3, hypothetical) = MetaconceptCombo(Regulation, Adaptation, Memory) - feedback-controlled learning with historical context",
        "ResilientModularEvolution (n=3, hypothetical) = MetaconceptCombo(Resilience, Modularity, Evolution) - fault-tolerant systems that adapt structure over time",
        "CompositePattern (n=2, Software) = MetaconceptCombo(Modularity, Imbrication) - recursive component trees",
        "EnzymeRegulationCascade (n=2, Biology) = MetaconceptCombo(Regulation, Amplification) - gain-controlled feedback loops",
        "MonetaryPolicy (n=2, Economics) = MetaconceptCombo(ValueSpace, Amplification) - credit expansion within bounded value space"
      ],
      "m2:perspective": "map",
      "m2:sphinxView": {
        "formulaPrimary": {
          "basis": "REVOI",
          "formula": "R ⊗ I ⊗ V",
          "role": "Evaluate: is the combo representable (R), interoperable across instances (I), and verifiable against parent metaconcepts (V)?",
          "note": "As n increases, V (verifiability) becomes critical bottleneck",
          "status": "PROPOSITION (validation in progress)"
        },
        "formulaFallback": {
          "basis": "ASFID",
          "formula": "S ⊗ I ⊗ A",
          "role": "Guaranteed measurement if REVOI fails - structure of the combination, information content, attractor stability of the emergent result",
          "status": "GUARANTEED"
        }
      },
      "m2:distinctionFromRelated": {
        "vs_Composition": "Composition (S ⊗ I ⊗ A) = assembly of heterogeneous PARTS into a whole (e.g., atoms → molecule). MetaconceptCombo = assembly of METACONCEPTS with emergence morphism ⇒ - operates at the ontological level, not the structural level.",
        "vs_Synergy": "Synergy (I ⊗ D) = observable combined effect in Territory (1+1>2, e.g., drug synergy). MetaconceptCombo = the MECHANISM that produces synergy at the metaconcept level - Synergy is the phenomenon, MetaconceptCombo is the construction operator.",
        "vs_Emergence": "Emergence (A ⊗ I ⊗ D) = spontaneous appearance of new properties from complex interactions (non-directed). MetaconceptCombo = DIRECTED emergence - parents are explicitly chosen parameters, coupling is predictable from shared dimensions.",
        "vs_Imbrication": "Imbrication (S ⊗ S) = self-similar nesting of IDENTICAL structure. MetaconceptCombo requires n DISTINCT parent metaconcepts (n ≥ 2). Same metaconcept repeated would reduce to Imbrication, not a synergistic combination.",
        "vs_naiveTensorProduct": "Naive ⊗ = simple concatenation of dimension spaces (dim_total = ∑ dim_i). MetaconceptCombo (⊗⇒) = coupled assembly where shared dimensions contract (dim_result < ∑ dim_i), producing irreducible emergent structure."
      },
      "m2:transdisciplinaryValidation": {
        "domains": [
          "Cybernetics: VSM S2 VarietyAmplification = ValueSpace ⊗ Amplification (directed variety control, n=2)",
          "Cybernetics: VSM S3 VarietyAttenuation = ValueSpace ⊗ Amplification (directed variety reduction, n=2)",
          "Cybernetics: VSM RecursiveViability = Imbrication ⊗ Autonomy (nested operational independence, n=2)",
          "Software Engineering: Composite pattern = Modularity ⊗ Imbrication (recursive component trees, n=2)",
          "Biology: Enzyme regulation cascade = Regulation ⊗ Amplification (gain-controlled feedback loops, n=2)",
          "Economics: Monetary policy = ValueSpace ⊗ Amplification (credit expansion within bounded value space, n=2)",
          "Control Theory: Cascaded controller = Regulation ⊗ Regulation (nested loops with emergent stability, n=2)",
          "Engineering: Redundant system = Resilience ⊗ Modularity (fault tolerance via independent subsystems, n=2)",
          "Machine Learning: Adaptive ensemble = Adaptation ⊗ Modularity ⊗ Synergy (multiple learners combining with synergistic effect, n=3)",
          "Ecology: Ecosystem resilience = Resilience ⊗ Diversity ⊗ Regulation (multi-species systems with regulatory feedback, n=3)"
        ],
        "validatedDomains": 10,
        "dominantArity": "n=2 (binary combination) in 80% of validated instances",
        "ternaryInstances": "n=3 observed in complex adaptive systems (ML ensembles, ecosystems)",
        "transdisciplinaryStrength": "Universal - any system requiring controlled synergistic combination of multiple independent capabilities produces a MetaconceptCombo instance. Arity (n) scales with system complexity and coupling requirements."
      },
      "m2:relationToCategoryTheoryMorphisms": {
        "assemblyOperator": "⊗ - pre-existing in m2:categoryTheory as basis for all M2 tensor formulas, extends naturally to n-ary ⊗ᵢ₌₁ⁿ",
        "emergenceOperator": "⇒ - pre-existing in m2:categoryTheory as morphism_emergence",
        "combinedOperator": "⊗ⁿ⇒ - novel unified structural operator for n-ary synergistic combination; both constituents pre-exist independently",
        "instantiation": "Concrete instances (VarietyAmplification, AdaptiveRegulatedLearning, etc.) produced via functor_instantiation F_inst: Cat_M2 → Cat_M1",
        "compositionality": "MetaconceptCombo instances can themselves be parents in higher-order combinations, enabling hierarchical emergence"
      },
      "m2:mathematicalNote": {
        "status": "REQUIRES EXPERT REVIEW",
        "emergenceProjector": "Can ⇒ (emergence morphism) be formalized as a projector operator P: ⊗ᵢ₌₁ⁿ H_Mᵢ → H_result within the M2 Hilbert space, where H_result ⊂ span(⊗ᵢ₌₁ⁿ H_Mᵢ) but H_result ≠ ⊗ᵢ₌₁ⁿ H_Mᵢ?",
        "couplingFormalization": "Shared dimensions between parents suggest a trace-like contraction on shared indices, analogous to tensor contraction in differential geometry. For n parents with k shared dimensions: dim(M_result) ≈ (∑ᵢ₌₁ⁿ dim(Mᵢ)) - k(n-1). Testable empirically on existing metaconcept pairs and triples.",
        "naryComplexity": "As n increases, the contraction structure becomes more complex. Question: does the emergence operator ⇒ impose additional constraints beyond dimensional contraction (e.g., orthogonality, minimality, attractor dynamics)?",
        "plausibility": "Mathematically plausible as constrained projection with multi-way tensor contraction - pending third-party validation by human expert or independent LLM. Binary case (n=2) is well-validated empirically through existing M1 instances."
      },
      "dcterms:created": "2026-01-31",
      "dcterms:modified": "2026-02-06",
      "dcterms:creator": "Echopraxium with the collaboration of Claude AI",
      "m2:discoveryContext": "Emerged from VSM modeling requirement: VarietyAmplification and VarietyAttenuation each combine two existing M2 metaconcepts (ValueSpace + Amplification) into a new capability that neither parent provides alone. The pattern is general - any directed synergistic fusion of multiple metaconcepts follows the same structural rule (⊗ⁿ⇒). Formalized as M2 metaconcept to enable systematic instantiation in M1 domain extensions. Originally noted in TO_DO as M1 - corrected to M2 as the generic mechanism belongs at the universal pattern level, while domain-specific instances belong in M1. N-ary generalization (n ≥ 2) added 2026-02-06 to remove artificial binary restriction and enable ternary/higher-order combinations observed in complex adaptive systems.",
      "m2:versionHistory": {
        "v1_2026-01-31": "Initial binary formulation (n=2 only)",
        "v2_2026-02-06": "Generalized to n-ary combination (n ≥ 2), added ternary examples, formalized coupling complexity, updated mathematical note for multi-way contraction"
      }
    }
